{
  "last_updated": "2025-07-24T10:18:05Z",
  "teams": [
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Bukayo Saka and Martin Odegaard scored Arsenal's only two penalties of 2024/25. They came in the same game and each player scored with the other on the pitch.",
          "source_link": ""
        },
        {
          "external_link": true,
          "info_message": "Saka and Odegaard missed spot-kicks in cup competitions last season, as did Leandro Trossard.",
          "source_link": ""
        }
      ],
      "id": 1
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Marco Asensio, Marcus Rashford and Jhon Duran all took penalties in 2024/25 but have since left the club.",
          "source_link": ""
        },
        {
          "external_link": true,
          "info_message": "Youri Tielemans took and missed Aston Villa's first Premier League spot-kick of 2024/25 in Gameweek 12. Ollie Watkins then took and scored the next two but missed from the spot in the Champions League in January.",
          "source_link": ""
        }
      ],
      "id": 2
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Evanilson took - and missed - Bournemouth's first spot-kick of 2024/25. Justin Kluivert then took and scored the next six after manager Andoni Iraola confirmed the two players were his two takers.",
          "source_link": ""
        },
        {
          "external_link": true,
          "info_message": "Antonie Semenyo took a penalty in the FA Cup in February with both Evanilson and Kluivert not on the field.",
          "source_link": ""
        }
      ],
      "id": 4
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Bryan Mbeumo took all of Brentford's penalties in 2024/25.",
          "source_link": ""
        },
        {
          "external_link": true,
          "info_message": "Yoane Wissa took a penalty for Brentford in the pre-season of 2024/25 with Mbeumo absent.",
          "source_link": ""
        }
      ],
      "id": 5
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Joao Pedro scored the first five of Brighton's penalties in 2024/25 but has since left the club. Danny Welbeck took and scored one with Pedro absent in May, with Matt O'Riley doing likewise on the final day with Welbeck and Pedro not present.",
          "source_link": ""
        }
      ],
      "id": 6
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Josh Brownhill and Jay Rodriguez took all of Burnley's penalties in 2024/25 but have now left the club. Two players who have rejoined the Clarets, Ashley Barnes and Jacob Bruun Larsen, have taken spot-kicks for Burnley in their previous spells.",
          "source_link": ""
        }
      ],
      "id": 3
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Cole Palmer took all of Chelsea's penalties in the league in 2024/25, with Christopher Nkunku taking all of the spot-kicks in the cup competitions.",
          "source_link": ""
        },
        {
          "external_link": true,
          "info_message": "Enzo Fernandez deputised on penalties in 2023/24.",
          "source_link": ""
        }
      ],
      "id": 7
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Jean-Philippe Mateta converted Palace's first two league spot-kicks of 2024/25, with Eberechi Eze taking the next two. Oliver Glasner has said the two share responsibility and decide between themselves on the pitch.",
          "source_link": ""
        }
      ],
      "id": 8
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Iliman Ndiaye took all of Everton's penalties in 2024/25, while long-term taker Dominic Calvert-Lewin has now left the club. Beto last took a competitive one in May 2024 and missed but scored another in July 2025 in a friendly. Ndiaye wasn't present.",
          "source_link": ""
        }
      ],
      "id": 9
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Raul Jimenez took and scored five penalties for Fulham in all competitions last season, with Andreas Pereira missing his only attempt.",
          "source_link": ""
        }
      ],
      "id": 10
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Pascal Struijk took four of Leeds' five penalties in 2024/25 and was off the field when Joel Piroe scored the other in February.",
          "source_link": ""
        }
      ],
      "id": 11
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Mohamed Salah took 12 Liverpool penalties in all competitions in 2024/25, scoring all but one of them. Cody Gakpo deputised from 12 yards in the Champions League in January when Salah was absent. Alexis Mac Allister scored two the previous season when covering for Salah.",
          "source_link": ""
        }
      ],
      "id": 12
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Erling Haaland was the regular taker in 2024/25 but Omar Marmoush surprisingly stepped up to take one - and missed - in the FA Cup final in May. Jack Grealish, Jeremy Doku and Matheus Nunes also all scored one penalty apiece in cup competitions.",
          "source_link": ""
        }
      ],
      "id": 13
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Bruno Fernandes has been United's main taker for several seasons. Others who have taken a spot-kick in the last two years include Christian Eriksen, who has left the club, and Marcus Rashford and Antony, who were out on loan in 2024/25.",
          "source_link": ""
        }
      ],
      "id": 14
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Alexander Isak was Newcastle's first-choice taker in 2024/25, with Anthony Gordon deputising in his absence. Fabian Schar also scored from the spot in the EFL Cup in October, when both Gordon and Isak were not on the field.",
          "source_link": ""
        }
      ],
      "id": 15
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Chris Wood took all of Forest's penalties last season. Morgan Gibbs-White previously scored one in 2023/24.",
          "source_link": ""
        }
      ],
      "id": 16
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Sunderland missed four of their five penalties in 2024/25, with Patrick Roberts the only one to score. Roberts, Wilson Isidor (twice) and Luke O'Nien all missed. O'Nien was the last to take one and afterwards, manager Regis Le Bris suggested that he had another taker in mind but didn't say who it was.",
          "source_link": ""
        }
      ],
      "id": 17
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Dominic Solanke took Spurs' last three penalties of 2024/25 but Son Heung-min was absent for all of them. By contrast, Solanke was present for all three of the spot-kicks that Son had taken earlier in the campaign. Mathys Tel and Richarlison deputised when neither of the above were on the field.",
          "source_link": ""
        }
      ],
      "id": 18
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Lucas Paqueta took two of West Ham's three penalties last season, with Jarrod Bowen deputising when Paqueta wasn't on the field.",
          "source_link": ""
        }
      ],
      "id": 19
    },
    {
      "notes": [
        {
          "external_link": true,
          "info_message": "Wolves didn't get a single spot-kick in 2024/25. Matheus Cunha, Hwang Hee-chan and Pablo Sarabia all scored penalties the previous season but Cunha and Sarabia have since left the club.",
          "source_link": ""
        }
      ],
      "id": 20
    }
  ]
}